package com.github.gimazdo.archeocat.util;

public class Messages {
    public static final String startMessage = "Привет! \n" +
            "Я - АрхеоКот, верный хранитель археологических коллекций Эрмитажа!\n" +
            "Рад приветствовать вас на АРХЕОфесте! Нас ждет увлекательное путешествие в мир эрмитажной археологии, а я буду Вашим проводником.\n" +
            "В меню ниже - функции:\n" +
            "\n" +
            "\uD83D\uDD0E<i>Программа фестиваля</i> - напомнит вам, когда в Эрмитаже будет происходить самое интересное.\n" +
            "\uD83D\uDD0E<i>КвестТест</i> - игровой маршрут для знакомства с археологической коллекцией Эрмитажа. Мы пройдем по основным залам, связанным с археологией. А я обращу ваше внимание на некоторые особые экспонаты. \n" +
            "\uD83D\uDD0E<i>Маршрут</i> - заблудиться в Эрмитаже - проще простого, но только не с маршрутами АрхеоКота! Мои разработчики продумали каждый маршрут до мелочей. Выбирайте один из трех предложенных маршрутов, и выдвигайтесь навстречу миру археологии!\n" +
            "\uD83D\uDD0E<i>Об экспозиции</i> - интересует конкретный зал? Смело вводите номер, а я с удовольствием расскажу вам основную информацию!\n" +
            "\uD83D\uDD0E<i>Хочу знать больше</i> - откровения археологов Государственного Эрмитажа, развеянные мифы и многое другое собрано студентами ВШЭ, представлено в виде интервью и подкастов!\n" +
            "\uD83D\uDD0E<i>Об АРХЕОфесте</i> - Фестиваль - это не только АрхеоКот, но и большая команда. Здесь вы сможете узнать об уникальном опыте сотрудничества Эрмитажа и ВШЭ при разработке проекта.\n" +
            "\uD83D\uDD0E<i>Поддержать проект</i> - Я собираю в экспедиции 32 группы археологов, узнайте, как можно им помочь! \n" +
            "\n" +
            "\uD83D\uDCA1<b>Это может быть интересно!</b> Советую вам присмотреться к <u>маршрутам</u> и <u>тест-квесту</u>! Также не пропустите уникальную информацию, полученную студентами ВШЭ от археологов Эрмитажа!\n" +
            "\n" +
            "\uD83D\uDCA1<i><b>Лайфхак</b>: во время нашего путешествия фраза <b> “Вернуться в меню”</b>, введенная в текстовое поле в любой момент поможет Вам вернуться в Главное меню.</i>\n";

    public static final String routeMessage = "Выберите начало маршрута";
    public static final String shuvalovskyStart = "Выберите сложность";
    public static final String mainStart = "Выберите сложность";
    public static final String choseLite = "Вы выбрали легкий уровень сложности";
    public static final String choseMedium = "Вы выбрали средний уровень сложности";
    public static final String SHUVALOVSKY_HARD_START_MESSAGE = "В рамках данного маршрута вас ждет полное погружение в мир археологии Эрмитажа! Мы вместе проследуем по всем залам, в которых представлены находки археологических экспедиций, и увидим самые удивительные экспонаты. Уверен, вы даже и не предполагали, что в Эрмитаже есть далеко не одна мумия!\n" +
            "<b>Длительность:</b> <i>около 2 часов.</i>\n" +
            "<b>Охват: </b><i>1-3 этажи музейного комплекса.</i>\n";
    public static final String NO_INFO_ABOUT_ROOM = "Нет информации о зале";

    public static final String ANSWER_INCORRECT = "Ответ неверный, попробуйте ещё раз";
    public static final String YOU_PASS_TEST = "Поздравляю! Вы ответили на все вопросы! \n" +
            "За время нашего путешествия мы многое узнали об эрмитажной археологии. Впереди нас ждут еще более интересные приключения по археологическим экспозициям музея. \n" +
            "До скорых встреч!";

    public static final String DONATE_MESSAGE = "Сегодня Государственный Эрмитаж может поддерживать более двадцати научных направлений, организуя свои археологические экспедиции.\n" +
            "Для эффективного проведения широкомасштабных и новаторских научных исследований на современном уровне и с использованием современной материально-технической базы требуется дополнительное финансирование.\n" +
            "Комплексное финансирование – со стороны государства, научных фондов и спонсоров – позволяет, с одной стороны, сделать науку доступной для общества, вовлечь людей, приходящих в залы музея, в мир археологии, научных исследований и открытий. С другой – это дает и самому обществу возможность участвовать в развитии фундаментальных научных тем, самостоятельно определяя и вкладывая ресурсы в развитие различных направлений.\n" +
            "\n" +
            "<b><a href=\"https://support.hermitagemuseum.org/ru/projects/archeology\">Поддержать проект</a></b>";
    public static final String FIRST_DAY_MESSAGE  = "<b>День 1. <i>21 мая 2022</i></b>\n" +
            "\n" +
            "<i>Экспозиция основного музейного комплекса.</i>\n" +
            "<b>Археология в Эрмитаже</b>\n" +
            "\n" +
            "<i>Галерея Растрелли</i>\n" +
            "<u>ЛЕКЦИИ</u>\n" +
            "\n" +
            "15.00-16.00 <b>С.В. Панкова.</b> Генетический анализ коллекции Эрмитажа.\n" +
            "\n" +
            "16.30-17.30 <b>Е.Н. Торшин.</b> Археологические раскопки на территории Эрмитажа\n" +
            "\n" +
            "<u>ВСТРЕЧИ С ХРАНИТЕЛЯМИ НА ЭКСПОЗИЦИЯХ</u>\n" +
            "\n" +
            "11.30 <b>Д.Е. Чистов.</b> Северное Причерноморье - история и Археология\n" +
            "\n" +
            "13.00 <b>Ю.Ю. Пиотровский.</b> Археологическое изучение Урарту\n" +
            "\n" +
            "14.30 <b>П.Б. Лурье</b>. Раскопки Пенджикента\n" +
            "\n" +
            "16.00 <b>К.В. Чугунов.</b> Курганы горного Алтая и Тувы\n" +
            "\n" +
            "<i>Атриум Главного штаба</i>\n" +
            "<u>КРУГЛЫЙ СТОЛ</u>\n" +
            "\n" +
            "18.00-20.00 <b>Археология - разрушение или созидание?</b>\n" +
            "\n" +
            "18.00 Приветственное слово генерального директора Государственного Эрмитажа М.Б. Пиотровского\n" +
            "\n" +
            "Модератор: А.М. Бутягин.\n" +
            "\n" +
            "К участию приглашены сотрудники Эрмитажа А.Ю. Алексеев, Е. А. Черленок, С. В. Томсинский,\n" +
            "А. Н. Мазуркевич и др.\n";

    public static final String SECOND_DAY_MESSAGE  =    "<b>День 2.<i> 22 мая 2022</i></b>\n" +
            "\n" +
            "<i>Экспозиция основного музейного комплекса</i>\n" +
            "<b>Археология в Эрмитаже</b>\n" +
            "\n" +
            "<i>Галерея Растрелли</i>\n" +
            "<u>ЛЕКЦИИ</u>\n" +
            "\n" +
            "15.00-16.00 С. Б. Адаксина. Раскопки крепости Чембало\n" +
            "16.30-17.30 Е. А. Черленок. Раскопки навеса Мешоко\n" +
            "\n" +
            "<u>ВСТРЕЧИ С ХРАНИТЕЛЯМИ НА ЭКСПОЗИЦИЯХ</u>\n" +
            "\n" +
            "13.00 А. Н. Мазуркевич. Подводная археология. Памятники эпохи неолита на Северо-Западе России\n" +
            "14.30 С. В. Томсинский. Экспозиция Древней Руси в Эрмитаже\n" +
            "16.00 Н. А. Сутягина. Кочевники Хунну. Могильник Ноин-Ула\n" +
            "\n" +
            "<i>Атриум Главного штаба</i>\n" +
            "<u>КРУГЛЫЙ СТОЛ</u>\n" +
            "\n" +
            "18.00-20.00 <b>Артефакт — экспонировать или хранить?</b>\n" +
            "\n" +
            "18.00 Приветственное слово генерального директора Государственного Эрмитажа М. Б. Пиотровского\n" +
            "\n" +
            "Модератор: И. К. Малкиель\n" +
            "\n" +
            "К участию приглашены сотрудники Эрмитажа С. Б. Адаксина, Ю. Ю. Семенова, А. Ю. Мазуркевич, А. М.Бутягин и др.\n";

    public static final String ABOUT_FESTIVAL_MESSAGE = "<b>АРХЕОфест</b> — особый формат проекта для музейных зрителей разного возраста. Два дня фестиваля насыщены встречами с сотрудниками-археологами, которые хранят, изучают\n" +
            "и пополняют древнейшие артефакты. \n" +
            "\n" +
            "<b>21 и 22 мая</b> у посетителей фестиваля появится уникальная возможность встретиться с известными эрмитажными специалистами в залах музея, узнать об  экспонатах из музейных коллекций. \n" +
            "\n" +
            "Помимо этого, у каждого есть возможность узнать много нового и интересного на онлайн-площадках. Творческая группа студентов <i>магистерской программы Arts&Culture Management Высшей Школы Экономики</i> подготовила множество материалов: видео-интервью с археологами, подкасты с хранителями и этот телеграм-бот!" +
            "<b> <i>Группа по подготовке программы и фестиваля ГЭ/ВШЭ :</i > </b>\n" +
            "\uD83D\uDCCD<b> Руководитель программы</b> —  А. М. Бутягин (ОАМ) \n" +
            "<b> Руководители проектов: </b> Е. В. Федоров (ОР), С. В. Кудрявцева (МЦ НПО), Е. В. Кузьминых   (Пресс-служба),  Ю. Г. Трабская (ВШЭ).\n" +
            "\uD83D\uDCCD<b> Рабочая группа проектов </b>— МЦ НПО: Р.В.Атаулин, А.С.Шевелева, М..Исмагилов, Е.С.Паникаровская, А. В.Тыренко; ОР- В.А.Маркевич,; ВШЭ: А.А. Горгадзе.\n" +
            "\uD83D\uDCCD<b> Инициативная группа студентов ВШЭ: </b> Егор Денисов, Анна Иванова, (подготовка промо-роликов,сьемка и монтаж видео). Ирина Цэруш, Елена Макарушина Елизавета Чеснокова, Юлия Шумилова (подготовка материалов для видео-интервью), Екатерина Шевченко, Дарья Кныш ( подкасты), Дмитрий Голощапов, Елена Макарушина, Юлия Шумилова  ( телеграм бот).\n" +
            "\uD83D\uDCCD<b> Автор логотипа фестиваля, дизайн буклетов и афиш </b>— А.С.Шевелева (МЦ)";
    public static final String FIRST_FLOOR_NEW_HERMITAGE_MESSAGE =  "\uD83D\uDEA9<b>Миллионная улица, Шуваловский подъезд: вход в Малый Эрмитаж.\n" +
            "Проход через турникеты</b> ➡ \n" +
            "<i>налево, вверх по лестнице, направо</i> \n" +
            "Вы попадаете в зал 102 и маршрут начинается!\n" +
            "<b>102</b>, Сивков переход ➡ \n" +
            "<b>101</b>, Античный мир ➡ \n" +
            "<b>128</b>, Зал Колыванской вазы, ➡ \n" +
            "<b>129</b>, Помпеянский Зал ➡ \n" +
            "<b>127</b>, Зал Августа➡ \n" +
            "<b>121</b>, Зал Боспора➡ \n" +
            "<b>119</b>, Античная колонизация Северного Причерноморья➡ \n" +
            "<b>115-117</b>, Искусство и культура античных городов Северного Причерноморья➡ \n" +
            "<b>114</b>, Зал Геракла➡ \n" +
            "<b>112</b>, Античный дворик➡ \n" +
            "<b>111</b>, Зал Архаики➡ \n" +
            "<i>Николаевский подъезд, Николаевская лестница</i> ➡ \n" +
            "<b>Поднимайтесь на 2 этаж</b>\n";

    public static final String  FIRST_FLOOR_WINTER_CASTLE_MESSAGE = "\uD83D\uDEA9<b>Спуск с Церковной лестницы</b>➡\n" +
            "<b>24</b>, Кутузовский коридор➡\n" +
            "<b>26-28</b>, Пазырык➡\n" +
            "<b>29-30-31-32</b>, Галерея Сибирь➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>55</b>, Искусство Армении➡\n" +
            "<b>57а</b>, Мощевая балка➡\n" +
            "<b>61</b>, История и культура Золотой Орды➡\n" +
            "<b>63</b>, Зал искусства Армении➡\n" +
            "<i>Царица Тамара укажет вам путь </i> ➡\n" +
            "<b>68-69</b>, Зал Золотая Орда➡\n" +
            "<b>54-53-52-51-49-48-47-46</b>, Залы Пенджикент\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>27а</b>, Зал Азербайджана➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<i>В середине 24 зала сверните на Салтыковскую лестницу, </i> ➡\n" +
            "<b>Наверх, на 3 этаж</b>\n";

    public static final String SECOND_FLOOR_MESSAGE_SHUVALOVSKY = "\uD83D\uDEA9<i>Вы поднялись по Николаевской лестнице</i>\n" +
            "<b>246</b>, Зал Ван Дейка➡\n" +
            "<b>247</b>, Зал Рубенса➡\n" +
            "<b>248</b>, Угловой зал➡\n" +
            "<i>Библиотечный переход</i>➡\n" +
            "<b>259</b>, Романовская галерея➡\n" +
            "<i>Переход к министерскому коридору</i>➡\n" +
            "<b>143-146</b>, Экспозиция русской иконы➡\n" +
            "<b>201</b>, Министерский коридор➡\n" +
            "<b>147-150</b>, Экспозиция древняя Русь (тупиковая)➡\n" +
            "<b>201</b>, Опять министерский коридор➡\n" +
            "<b>193</b>, Фельдмаршальский зал➡\n" +
            "<b>151, 153,</b> Восточная галерея➡\n" +
            "<i>вниз по Церковной лестнице на 1 этаж</i>➡\n" +
            "<b>Продолжение осмотра </b>➡\n" +
            "\n" +
            "\uD83D\uDEA9<b><i>окончание осмотра</i>, направляетесь к Шуваловскому подъезду</b>\n" +
            "<i>С 3 этажа по церковной лестнице вниз на 2 этаж.</i>➡\n" +
            "<b>153, 151</b>, Восточная галерея ➡\n" +
            "<b>193</b>, Фельдмаршальский зал➡\n" +
            "<i>Иорданская лестница</i>➡\n" +
            "<i>Галерея Растрелли</i>➡\n" +
            "<b>100</b>, Зал Египта➡\n" +
            "<i>Сивков переход</i>➡\n" +
            "<i>Зона малого Эрмитажа</i> ➡\n" +
            "<i>Шуваловский подъезд, гардероб</i>➡\n" +
            "<b>Окончание маршрута.</b>\n";

    public static final String THIRD_FLOOR_MESSAGE_SHUVALOVSKY = "<i>Вы поднялись по Салтыковской лестнице на 3 этаж.</i>\n" +
            "<b>359</b>, Культура и искусство кучарского оазиса➡\n" +
            "<b>357</b>, Зал Ширмы➡\n" +
            "<b>360-361</b>, Зал “Пещеры 1000 Будд”, Индия➡\n" +
            "<b>362-363</b>, Искусство Новый Китай➡\n" +
            "<b>364-365</b>, Залы искусства Монголии и Тибета➡\n" +
            "<b>366-367</b>, Азиатские гунны, Монголия и Тибет ➡\n" +
            "<b>381-382</b>, Экспозиция Византия➡\n" +
            "<b>383-390</b>, Залы древнего Ирана➡\n" +
            "<b>391-394</b>, Искусство Ирана III-нач. XX вв.➡\n" +
            "<i>По церковной лестнице вниз на 2 этаж.</i>\n";

    public static final  String LITE_SHUVALOVSKY_START_MESSAGE ="Маршрут “Лайт” - возможность сфокусироваться на самых ярких памятниках археологических экспозиций Эрмитажа. С ним вы не пропустите самого главного!\n" +
            "Готовы, тогда стартуем!\n" +
            "<b>Длительность:</b> <i>1 час 20 минут.</i>\n" +
            "<b>Охват: </b><i>1-2 этаж музейного комплекса.</i>";
    public static final  String LITE_SHUVALOVSKY_2_MESSAGE ="<b>Миллионная улица, Шуваловский подъезд: вход в Малый Эрмитаж.\n" +
            "Проход через турникеты</b> ➡ \n" +
            "<i>налево, вверх по лестнице, направо</i> \n" +
            "Вы попадаете в зал 102 и маршрут начинается!\n" +
            "<b>102</b>, Сивков переход ➡ \n" +
            "<b>101</b>, Античный мир ➡ \n" +
            "<b>128</b>, Зал Колыванской вазы, ➡ \n" +
            "<b>129</b>, Помпеянский Зал ➡ \n" +
            "<b>127</b>, Зал Августа➡ \n" +
            "<b>121</b>, Зал Боспора➡ \n" +
            "<b>119</b>, Античная колонизация Северного Причерноморья➡ \n" +
            "<b>115-117</b>, Искусство и культура античных городов Северного Причерноморья➡ \n" +
            "<b>114</b>, Зал Геракла➡ \n" +
            "<b>112</b>, Античный дворик➡ \n" +
            "<b>111</b>, Зал Архаики➡ \n" +
            "<b>110</b>, Парадный вестибюль Нового Эрмитажа➡ \n" +
            "<b>109</b>, Зал Диониса➡ \n" +
            "<b>108</b>, Римский дворик➡ \n" +
            "<b>107</b>, Зал Юпитера➡ \n" +
            "<b>106</b>, Римская скульптура II-III вв.➡ \n" +
            "<b>102</b>, Сивков переход➡ \n" +
            "<b>101</b>, Площадка Сивкова перехода➡ \n" +
            "<b>100</b>, Древний Египет➡ \n" +
            "<i>Галерея Растрелли</i>➡ \n" +
            "<i>Иорданская лестница</i>➡ \n" +
            "<b>Поднимайтесь на 2 этаж</b>";
    public static final  String LITE_SHUVALOVSKY_3_MESSAGE = "<b>Вы на 2 этаже</b>\n" +
            "<i>Иорданская лестница</i>\n" +
            "<b>193</b>, Фельдмаршальский зал\n" +
            "<b>151, 153</b>, Восточная галерея\n" +
            "<i>Вниз по Церковной лестнице на 1 этаж</i>\n" +
            "\n";

    public static final  String LITE_SHUVALOVSKY_4_MESSAGE = "<b>Спуск с Церковной лестницы</b>➡\n" +
            "<b>24</b>, Кутузовский коридор➡\n" +
            "<b>26-28</b>, Пазырык➡\n" +
            "<b>29-30-31-32</b>, Галерея Сибирь➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>55</b>, Искусство Армении➡\n" +
            "<b>57а</b>, Мощевая балка➡\n" +
            "<b>61</b>, История и культура Золотой Орды➡\n" +
            "<b>63</b>, Зал искусства Армении➡\n" +
            "<i>Царица Тамара укажет вам путь </i> ➡\n" +
            "<b>68-69</b>, Зал Золотая Орда➡\n" +
            "<b>54-53-52-51-49-48-47-46</b>, Залы Пенджикент\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>27а</b>, Зал Азербайджана➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>По церковной лестнице на 2 этаж</b>\n";
    public static final  String LITE_SHUVALOVSKY_5_MESSAGE = "\uD83D\uDEA9<b>По церковной лестнице на 2 этаж</b>\n" +
            "<b>153, 151</b>, Восточная галерея ➡\n" +
            "<b>193</b>, Фельдмаршальский зал➡\n" +
            "<i>Иорданская лестница</i>➡\n" +
            "<i>Галерея Растрелли</i>➡\n" +
            "<b>100</b>, Зал Египта➡\n" +
            "<i>Сивков переход</i>➡\n" +
            "<i>Зона малого Эрмитажа</i> ➡\n" +
            "<i>Шуваловский подъезд, гардероб</i>➡\n" +
            "<b>Окончание маршрута.</b>\n";

    public static final String I_WANT_MORE_MESSAGE_1 = "Археология - историческая дисциплина, включающая в себя великое множество знаний о прошлом человечества. \n" +
            "\n" +
            "Работа археологов в наше время актуальна как никогда. <u>32 экспедиции Государственного Эрмитажа</u> работают с целью получения истинных знаний о жизни наших предков.\n" +
            "Истинные эксперты, руководители экспедиций, поговорили со студентами Высшей Школы Экономики и ответили на интересующие вопросы, рассказали о профессии и жизни археологов, раскрыли некоторые тайны и даже развеяли мифы!\n" +
            "Нам удалось получить множество интереснейших инсайтов. Мир эрмитажной археологии открыт для вас!\n" +
            "\n" +
            "<i>Скорее переходите по ссылкам!</i>\n";

    public static final String I_WANT_MORE_MESSAGE_2 = "Интервью с руководителями экспедиций:\n" +
            "<a href=\"https://vk.com/video/playlist/-4716949_51672802\"> \n" +
            "Здесь мы собрали уникальную коллекцию видеоинтервью с хранителями отделов археологии Эрмитажа, подготовленных студентами программы Arts and Culture Management НИУ ВШЭ специально для программы Эрмитажная Археология. Экспедиции. Экспозиции. Эксперты в области археологии Государственного Эрмитажа поделились со студентами многими интересными нюансами о  профессии археолог, рассказали о процессе работы, о трудностях, с которыми сталкиваются, а также о том, почему они любят свое дело. </a>";
    public static final String I_WANT_MORE_MESSAGE_3 ="Подкаст:\n" +
            "<a href=\"https://music.yandex.ru/album/10396951?dir=desc&activeTab=about\">Специальный выпуск #1 подкаста “Руками не трогать” Молодежного центра Эрмитажа: \n" +
            "“Будни археолога: вечеринки в поле, путешествие в античный город и работа в музее”. </a>\n";

    public static final String QUEST_ROUTE_1_MESSAGE = "\uD83D\uDEA9<b>Миллионная улица, Шуваловский подъезд: вход в Малый Эрмитаж.\n" +
            "Проход через турникеты</b> ➡ \n" +
            "<i>налево, вверх по лестнице, направо</i> \n" +
            "Вы попадаете в зал 102 и маршрут начинается!\n" +
            "<b>102</b>, Сивков переход ➡ \n" +
            "<b>106</b>, Античный мир ➡ \n" +
            "<b>128</b>, Зал Колыванской вазы, ➡ \n" +
            "<b>129</b>, Помпеянский Зал ➡ \n" +
            "<b>127</b>, Зал Августа➡ \n" +
            "<b>121</b>, Зал Боспора➡ \n" +
            "<b>119</b>, Античная колонизация Северного Причерноморья➡ \n" +
            "<b>117</b>, Зал культуры и искусства античных городов Северного Причерноморья\n" +
            "<b><i>зал 117</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>115</b>, Зал культуры и искусства античных городов Северного Причерноморья\n" +
            "<b><i>зал 115</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>112</b>, Античный дворик\n" +
            "<b><i>зал 112</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>110</b>, Парадный вестибюль Нового Эрмитажа➡ \n" +
            "<b>109</b>, Зал Диониса ➡ \n" +
            "<b>108</b>, Римский дворик➡ \n" +
            "<b>107</b>, Зал Юпитера➡ \n" +
            "<b>106</b>, Римская скульптура II-III вв.➡ \n" +
            "<b>102</b>, Сивков переход➡ \n" +
            "<b>101</b>, Площадка Сивкова перехода➡ \n" +
            "<b>100</b>, Древний Египет➡ \n" +
            "<i>Галерея Растрелли</i>➡ \n" +
            "<i>Иорданская лестница</i>➡ \n" +
            "<b>Поднимайтесь на 2 этаж</b>";

    public static final String QUEST_ROUTE_2_MESSAGE ="\uD83D\uDEA9<b>Вы на 2 этаже</b>\n" +
            "<i>Иорданская лестница</i>\n" +
            "<b>193</b>, Фельдмаршальский зал\n" +
            "<b>151, 153</b>, Восточная галерея\n" +
            "<i>Вниз по Церковной лестнице на 1 этаж</i>";

    public static final String QUEST_ROUTE_3_MESSAGE = "\uD83D\uDEA9<b>Спуск с Церковной лестницы</b>➡\n" +
            "<b>24</b>, Кутузовский коридор➡\n" +
            "<b>26-28</b>, Пазырык➡\n" +
            "<b><i>зал 26</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>29-30-31-32</b>, Галерея Сибирь➡\n" +
            "<b><i>зал 28</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b><i>зал 31</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b><i>зал 33</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>55</b>, Искусство Армении➡\n" +
            "<b>57а</b>, Мощевая балка➡\n" +
            "<b><i>зал 57а</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>61</b>, История и культура Золотой Орды➡\n" +
            "<b>63</b>, Зал искусства Армении➡\n" +
            "<i>Царица Тамара укажет вам путь </i> ➡\n" +
            "<b>68-69</b>, Зал Золотая Орда➡\n" +
            "<b>54-53-52-51-49-48-47-46</b>, Залы Пенджикент\n" +
            "<b><i>зал 49</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>27а</b>, Зал Азербайджана➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<i>В середине 24 зала сверните на Салтыковскую лестницу, </i> ➡\n" +
            "<b>Наверх, на 3 этаж</b>\n";

    public static final String QUEST_ROUTE_4_MESSAGE = "<i>Вы поднялись по Салтыковской лестнице на 3 этаж.</i>\n" +
            "<b>359</b>, Культура и искусство кучарского оазиса➡\n" +
            "<b><i>зал 359</i></b> - ВНИМАНИЕ ВОПРОС❓\n" +
            "<i>По церковной лестнице вниз на 2 этаж.</i>\n" +
            "<b><i>ПОЗДРАВЛЯЮ! Вы прошли игру!</i></b>\n";


    public static final String MAIN_HARD_1_MESSAGE = "<b>Вы вошли через главный вход в Эрмитаж.</b>\n" +
            "Направляйтесь через Школьный гардероб, на начало официального маршрута по Эрмитажу <i>“МАРШРУТ 2”</i>.\n" +
            "<b>Старт у Церковной лестницы</b>➡\n" +
            "<b>24</b>, Кутузовский коридор➡\n" +
            "<b>26-28</b>, Пазырык➡\n" +
            "<b>29-30-31-32</b>, Галерея Сибирь➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>55</b>, Искусство Армении➡\n" +
            "<b>57а</b>, Мощевая балка➡\n" +
            "<b>61</b>, История и культура Золотой Орды➡\n" +
            "<b>63</b>, Зал искусства Армении➡\n" +
            "<i>Царица Тамара укажет вам путь </i> ➡\n" +
            "<b>68-69</b>, Зал Золотая Орда➡\n" +
            "<b>54-53-52-51-49-48-47-46</b>, Залы Пенджикент\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>27а</b>, Зал Азербайджана➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<i>В середине 24 зала сверните на Салтыковскую лестницу, </i> ➡\n" +
            "<b>Наверх, на 3 этаж</b>\n";

    public static final String MAIN_HARD_2_MESSAGE = "<i>Вы поднялись по Салтыковской лестнице на 3 этаж.</i>\n" +
            "<b>359</b>, Культура и искусство кучарского оазиса➡\n" +
            "<b>357</b>, Зал Ширмы➡\n" +
            "<b>360-361</b>, Зал “Пещеры 1000 Будд”, Индия➡\n" +
            "<b>362-363</b>, Искусство Новый Китай➡\n" +
            "<b>364-365</b>, Залы искусства Монголии и Тибета➡\n" +
            "<b>366-367</b>, Азиатские гунны, Монголия и Тибет ➡\n" +
            "<b>381-382</b>, Экспозиция Византия➡\n" +
            "<b>383-390</b>, Залы древнего Ирана➡\n" +
            "<b>391-394</b>, Искусство Ирана III-нач. XX вв.➡\n" +
            "<i>По церковной лестнице вниз на 2 этаж.</i>\n";
    public static final String MAIN_HARD_3_MESSAGE = " <b>Продолжение осмотра </b>➡\n" +
            "<b>151, 153,</b> Восточная галерея➡\n" +
            "<b>193</b>, Фельдмаршальский зал➡\n" +
            "<b>201</b>, Министерский коридор➡\n" +
            "<b>147-150</b>, Экспозиция древняя Русь (тупиковая)➡\n" +
            "<b>201</b>, Опять министерский коридор➡\n" +
            "<b>143-146</b>, Экспозиция русской иконы➡\n" +
            "<i>Переход к министерскому коридору</i>➡\n" +
            "<b>258</b>, Романовская галерея➡\n" +
            "<i>Библиотечный переход</i>➡\n" +
            "<b>248</b>, Угловой зал➡\n" +
            "<b>247</b>, Зал Рубенса➡\n" +
            "<b>246</b>, Зал Ван Дейка➡\n" +
            "<i>вниз по Николаевской лестнице на 1 этаж</i>➡\n" +
            "<b>Продолжение осмотра </b>➡\n";
    public static final String MAIN_HARD_4_MESSAGE = "\uD83D\uDEA9<i>Вы спустились по Николаевской лестнице</i>\n" +
            "<b>111</b>, Зал Архаики➡ \n" +
            "<b>112</b>, Античный дворик➡\n" +
            "<b>114</b>, Зал Геракла➡\n" +
            "<b>115-117</b>, Искусство и культура античных городов Северного Причерноморья➡\n" +
            "<b>119</b>, Античная колонизация Северного Причерноморья➡\n" +
            "<b>121</b>, Зал Боспора➡\n" +
            "<b><i>окончание осмотра</i>, направляетесь к Главному вестибюлю</b> <i>через залы:</i>\n" +
            "<b>127</b>, Зал Августа➡\n" +
            "<b>129</b>, Помпеянский Зал ➡\n" +
            "<b>128</b>, Зал Колыванской вазы, ➡\n" +
            "<b>106</b>, Античный мир ➡\n" +
            "<b>102</b>, Сивков переход ➡\n" +
            "<b>101</b>,Площадка Сивкова перехода➡\n" +
            "<b>100</b>, Зал Египта➡\n" +
            "<i>Галерея Растрелли</i>➡\n" +
            "<i>Иорданская галерея</i>➡\n" +
            "<i>Главный вестибюль</i>➡\n" +
            "<b>Окончание маршрута.</b>\n";

    public static final String MAIN_LITE_1_MESSAGE = "<b>Вы вошли через главный вход в Эрмитаж.</b>\n" +
            "Направляйтесь через Школьный гардероб, на начало официального маршрута по Эрмитажу <i>“МАРШРУТ 2”</i>.\n" +
            "<b>Старт у Церковной лестницы</b>\n" +
            "<b>24</b>, Кутузовский коридор➡\n" +
            "<b>26-28</b>, Пазырык➡\n" +
            "<b>29-30-31-32</b>, Галерея Сибирь➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>55</b>, Искусство Армении➡\n" +
            "<b>57а</b>, Мощевая балка➡\n" +
            "<b>61</b>, История и культура Золотой Орды➡\n" +
            "<b>63</b>, Зал искусства Армении➡\n" +
            "<i>Царица Тамара укажет вам путь </i> ➡\n" +
            "<b>68-69</b>, Зал Золотая Орда➡\n" +
            "<b>54-53-52-51-49-48-47-46</b>, Залы Пенджикент\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<b>27а</b>, Зал Азербайджана➡\n" +
            "<b>33</b>, Кутузовский коридор➡\n" +
            "<i>Церковная лестница.</i>\n" +
            "<b>Наверх, на 2 этаж</b>\n";
    public static final String MAIN_LITE_2_MESSAGE = "<i>Вы поднялись по Церковной лестнице на 2 этаж.</i>\n" +
            " <b>Продолжение осмотра </b>➡\n" +
            "<b>151, 153,</b> Восточная галерея➡\n" +
            "<b>193</b>, Фельдмаршальский зал➡\n" +
            "<b>201</b>, Министерский коридор➡\n" +
            "<b>147-150</b>, Экспозиция древняя Русь (тупиковая)➡\n" +
            "<b>201</b>, Опять министерский коридор➡\n" +
            "<b>143-146</b>, Экспозиция русской иконы➡\n" +
            "<i>Переход к министерскому коридору</i>➡\n" +
            "<b>258</b>, Романовская галерея➡\n" +
            "<i>Библиотечный переход</i>➡\n" +
            "<b>248</b>, Угловой зал➡\n" +
            "<b>247</b>, Зал Рубенса➡\n" +
            "<b>246</b>, Зал Ван Дейка➡\n" +
            "<i>вниз по Николаевской лестнице на 1 этаж</i>➡\n" +
            "<b>Продолжение осмотра </b>➡\n";

    public static final String MAIN_LITE_3_MESSAGE = "\uD83D\uDEA9<i>Вы спустились по Николаевской лестнице</i>\n" +
            "<b>111</b>, Зал Архаики➡ \n" +
            "<b>112</b>, Античный дворик➡\n" +
            "<b>114</b>, Зал Геракла➡\n" +
            "<b>115-117</b>, Искусство и культура античных городов Северного Причерноморья➡\n" +
            "<b>119</b>, Античная колонизация Северного Причерноморья➡\n" +
            "<b>121</b>, Зал Боспора➡\n" +
            "<b><i>окончание осмотра</i>, направляетесь к Главному вестибюлю</b> <i>через залы:</i>\n" +
            "<b>127</b>, Зал Августа➡\n" +
            "<b>129</b>, Помпеянский Зал ➡\n" +
            "<b>128</b>, Зал Колыванской вазы, ➡\n" +
            "<b>106</b>, Античный мир ➡\n" +
            "<b>102</b>, Сивков переход ➡\n" +
            "<b>101</b>,Площадка Сивкова перехода➡\n" +
            "<b>100</b>, Зал Египта➡\n" +
            "<i>Галерея Растрелли</i>➡\n" +
            "<i>Иорданская галерея</i>➡\n" +
            "<i>Главный вестибюль</i>➡\n" +
            "<b>Окончание маршрута.</b>\n";

    public static final String MAIN_HARD_START_MESSAGE = "В рамках данного маршрута вас ждет полное погружение в мир археологии Эрмитажа! Мы вместе проследуем по всем залам, в которых представлены находки археологических экспедиций, и увидим самые удивительные экспонаты. Уверен, вы даже и не предполагали, что в Эрмитаже есть далеко не одна мумия!\n" +
            "<b>Длительность:</b> <i>около 2 часов.</i>\n" +
            "<b>Охват: </b><i>1-3 этажи музейного комплекса.</i>\n";
    public static final String MAIN_LITE_START_MESSAGE = "Маршрут “Лайт” - возможность сфокусироваться на самых ярких памятниках археологических экспозиций Эрмитажа. С ним вы не пропустите самого главного!\n" +
            "Готовы, тогда стартуем!\n" +
            "<b>Длительность:</b> <i>1 час 20 минут.</i>\n" +
            "<b>Охват: </b><i>1-2 этаж музейного комплекса.</i>\n";

}
